tap "homebrew/bundle"
tap "homebrew/services"
brew "openssl@3"
brew "xz"
brew "cmake"
brew "gh"
brew "git"
brew "little-cms2"
brew "webp"
brew "mas"
brew "nvm"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.12"
brew "rust"
brew "stow"
brew "tcl-tk"
brew "tesseract"
brew "tesseract-lang"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zlib"
cask "dbeaver-community"
cask "docker"
cask "pgadmin4"
cask "postman"
cask "visual-studio-code"
mas "eDrawings", id: 1209754386
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "LimeChat", id: 414030210
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Shapr3D", id: 1091675654
mas "SimpleMind", id: 439654198
mas "Slack", id: 803453959
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "batisteo.vscode-django"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "formulahendry.code-runner"
vscode "kevinrose.vsc-python-indent"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "njpwerner.autodocstring"
vscode "thiscodeworks.savecode"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wholroyd.jinja"
